import { makeAutoObservable } from "mobx";

class Store {
  data = [
    {
      "header": "Заголовок 1",
      "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
      "text": "какой-то текст 1 текст какой-то 1 какой-то текст 1"
    },
    {
      "header": "Заголовок 2",
      "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
      "text": "какой-то текст 2 текст какой-то 2 какой-то текст 2"
    },
    {
      "header": "Заголовок 3",
      "options": ["элемент списка 1", "элемент списка 2", "элемент списка 3"],
      "text": "какой-то текст 3 текст какой-то 3 какой-то текст 3"
    }
  ];

  constructor() {
    makeAutoObservable(this);
  }

}

export default new Store();